["Questions: Does the candidate have atleast 1 year of experience in Python?\nCAP: \nAssessment Area: \nweight: 3", "Questions: Has the candidate used langchain or llamaindex frameworks to develop GEN AIapplications?\nCAP: \nAssessment Area: \nweight: 3", "Questions: Does the candidate have exposure to either Azure or AWS or GCP platforms?\nCAP: \nAssessment Area: \nweight: 3", "Questions: Has the candidate attained any GCP or AWS or Azure generaive ai or machine learning certifications?\nCAP: \nAssessment Area: \nweight: 2", "Questions: Is the candidate experienced in clustering & machine learning algorithms like random forest, linear regression, xgboost, decison trees, extratreetregressor, logistic regression,ARIMA, SARIMA, Prophet, K-Means?\nCAP: \nAssessment Area: \nweight: 4", "Questions: Does the candidate know Pyspark or Spark?\nCAP: \nAssessment Area: \nweight: 1", "Questions: Does the candidate have experience with finetuning large language models using PEFT LoRa Techniques ?\nCAP: \nAssessment Area: \nweight: 2", "Questions: Has the candidate worked with vector databases (Chromadb/Qdrant,FAISS,HanaVectorDB)  or embeddings?\nCAP: \nAssessment Area: \nweight: 4", "Questions: Does the candidate have experience with either of the Python frameworks (Django, Flask, FastAPI) and ORM tools.\nCAP: \nAssessment Area: \nweight: 4", "Questions: Does the candidate possess knowledge of DevOps practices for AI, including continuous integration and deployment (CI/CD) for AI models.\nCAP: \nAssessment Area: \nweight: 4", "Questions: Does the resume mention asynchronous programming (Celery, Redis).\nCAP: \nAssessment Area: \nweight: 2", "Questions: Has the candidate worked with SQL/NoSQL databases (PostgreSQL, MongoDB).\nCAP: \nAssessment Area: \nweight: 4", "Questions: Does candidate have experience with the project management tools, like Jira\nCAP: \nAssessment Area: \nweight: 1", "Questions: Does the candidate know about queuing and streaming mechanisms for asynchronous and real-time data processing.\nCAP: \nAssessment Area: \nweight: 1", "Questions: Has the candidate worked with Docker and Kubernetes\nCAP: \nAssessment Area: \nweight: 3", "Questions: Has the candidate used responsible AI practices, including guardrails and moderation mechanisms.\nCAP: \nAssessment Area: \nweight: 2", "Questions: Does the candidate have experience in Deep Learning libraries like Tensorflow, Pytorch etc.\nCAP: \nAssessment Area: \nweight: 3", "Questions: Does the candidate have experience in libaries like Pandas, Numpy, Scikit-learn?\nCAP: \nAssessment Area: \nweight: 3"]